In [1]:
import mysql.connector

mydb = mysql.connector.connect(
    user='root',
    passwd='root',
    host='localhost',
    database='learning_sql_database'
)

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x00000222861B1A00>

### SELECT queries 101
To retrieve data from a SQL database, we need to write `SELECT` statements, which are often colloquially refered to as `queries`.

Select query for a specific columns:  
`SELECT column, another_column, …`  
`FROM mytable;`

In [2]:
# To fetch all data from table, use `SELECT *`.
# To fetch concrete data from table, use `SELECT <name_of_column>`.
mycursor = mydb.cursor()

sql = "SELECT Title, Year FROM sql_lesson_1_movies"

mycursor.execute(sql)

In [3]:
myresult = mycursor.fetchall() # возвращает массив, индексированный именами столбцов результирующего набора

In [4]:
for i in myresult:
    print(i)

('Finding Nemo', 2003)
('Brave', 2012)
('Monsters, Inc.', 2001)
('Cars 2', 2011)
('Up', 2009)
('Monsters University', 2013)
('Toy Story 2', 1999)
('Ratatouille', 2007)
('Toy Story 3', 2010)
('Cars', 2006)
('The Incredibles', 2004)
('A Bugs Life', 1998)
('Toy Story', 1995)
('WALL-E', 2008)

In [5]:
sql = "SELECT Title, Director FROM sql_lesson_1_movies"

import pandas as pd
pd.read_sql_query(sql, mydb)

                  Title        Director
0          Finding Nemo  Andrew Stanton
1                 Brave  Brenda Chapman
2        Monsters, Inc.     Pete Docter
3                Cars 2   John Lasseter
4                    Up     Pete Docter
5   Monsters University     Dan Scanlon
6           Toy Story 2   John Lasseter
7           Ratatouille       Brad Bird
8           Toy Story 3     Lee Unkrich
9                  Cars   John Lasseter
10      The Incredibles       Brad Bird
11          A Bugs Life   John Lasseter
12            Toy Story   John Lasseter
13               WALL-E  Andrew Stanton